app/controllers/line_items_controller.rb

  def create
     @cart = current_cart
    product = Product.find(params[:product_id])
   @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 16]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-11-20 09:26:07.923393"], ["updated_at", "2014-11-20 09:26:07.923393"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 19], ["created_at", "2014-11-20 11:38:35.595509"], ["product_id", 17], ["updated_at", "2014-11-20 11:38:35.595509"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 3  [["quantity", 2], ["updated_at", "2014-11-20 11:52:08.578478"]]