app/controllers/orders_controller.rb

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items"  WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 36]]
SELECT "line_items".* FROM "line_items"  WHERE "line_items"."cart_id" = ?  [["cart_id", 36]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-11-21 12:11:21.695986"], ["updated_at", "2014-11-21 12:11:21.695986"]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "dfgdfgfd"], ["created_at", "2014-11-21 08:47:35.960170"], ["email", "dfgdfgdfg"], ["name", "Mariya"], ["pay_type", "Credit card"], ["updated_at", "2014-11-21 08:47:35.960170"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 36]]