app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-21 13:27:59.185357"], ["name", "bob"], ["password_digest", "$2a$10$yuaOftwohUp3ppSgGIYHieZGI37SZB9grcAZSjpT0lcwXMVJOQC6u"], ["updated_at", "2014-11-21 13:27:59.185357"]]